[["Intro",[{"text":"Gary Leon Ridgway (born February 18, 1949) is an American serial killer known as the Green River Killer.","links":[{"page":"List of serial killers in the United States","src":"American"},{"page":"Serial killer"}]},{"text":"He was initially convicted of 48 separate murders and later confessed to nearly twice that number.","links":[{"page":"Murder"}]},{"text":"As part of his plea bargain, an additional conviction was added, bringing the total number of convictions to 49, making him the most prolific American serial killer in history according to confirmed murders.","links":[{"page":"Plea bargain"},{"page":"Conviction"}]},{"text":"He murdered numerous women and girls in Washington State during the 1980s and 1990s.","links":[{"page":"Washington (state)","src":"Washington State"}]},{"text":"Most of his victims were alleged to be prostitutes and other women in vulnerable situations, including underage runaways.","links":[{"page":"Prostitute"}]},{"text":"The press gave him his nickname after the first five victims were found in the Green River before his identity was known.","links":[{"page":"Green River (Duwamish River)","src":"Green River"}]},{"text":"He strangled the women, usually by hand but sometimes using ligatures.","links":[{"page":"Strangling","src":"strangled"},{"page":"Strangling strangulation","src":"ligatures"}]},{"text":"After strangling them, he would dump their bodies in forested and overgrown areas in King County, often returning to the dead bodies to have sexual intercourse with them.","links":[{"page":"Dump job usage","src":"dump their bodies"},{"page":"King County, Washington","src":"King County"},{"page":"Necrophilia","src":"dead bodies to have sexual intercourse with them"}]},{"text":"On November 30, 2001, as he was leaving the Kenworth truck factory where he worked in Renton, Washington, he was arrested for the murders of four women whose cases were linked to him through DNA evidence.","links":[{"page":"Kenworth"},{"page":"Renton, Washington"},{"page":"DNA"}]},{"text":"As part of a plea bargain wherein he agreed to disclose the locations of still-missing women, he was spared the death penalty and received a sentence of life imprisonment without parole.","links":[{"page":"Plea bargain"},{"page":"Capital punishment","src":"death penalty"},{"page":"Life imprisonment in the United States","src":"life imprisonment without parole"}]}]],["Childhood",[{"text":"Gary Leon Ridgway was born on February 18, 1949, in Salt Lake City, Utah."},{"text":"He was the second of Mary and Thomas Ridgway's three sons."},{"text":"His home life was somewhat troubled; relatives have described his mother as domineering and have said that young Ridgway witnessed more than one violent argument between his parents."},{"text":"His father was a bus driver who would often complain about the presence of prostitutes."},{"text":"Gary Ridgway was tested with an I.Q. of 82. When he was 16, he stabbed a six-year-old boy, who survived the attack."},{"text":"He had led the boy into the woods and then stabbed him through the ribs into his liver."}]],["Adult life",[{"text":"Ridgway graduated from Tyee High School at age 20 in 1969 and married his 19-year-old high school girlfriend Claudia Kraig.","links":[{"page":"Tyee Educational Complex","src":"Tyee High School"}]},{"text":"He joined the Navy and was sent to Vietnam, where he served on board a supply ship and saw combat.","links":[{"page":"United States Navy","src":"Navy"},{"page":"Vietnam War","src":"Vietnam"},{"page":"Auxiliary ship","src":"supply ship"}]},{"text":"During his time in the military, Ridgway began to have frequent sexual intercourse with numerous prostitutes and contracted gonorrhea.","links":[{"page":"Gonorrhea"}]},{"text":"Although angered by this, he continued to have unprotected sex with prostitutes."},{"text":"While Ridgway was abroad, Kraig had an extramarital affair.","links":[{"page":"Adultery","src":"extramarital affair"}]},{"text":"The marriage ended within a year."},{"text":"When questioned about Ridgway after his arrest, friends and family described him as friendly but strange."},{"text":"His first two marriages resulted in divorce because of infidelities by both partners."},{"text":"His second wife, Marcia Winslow, claimed that he had placed her in a chokehold.","links":[{"page":"Chokehold"}]},{"text":"He had become religious during his second marriage, proselytizing door-to-door, reading the Bible aloud at work and at home, and insisting that his wife follow the strict teachings of their church pastor."},{"text":"Ridgway would also frequently cry after sermons or reading the Bible."},{"text":"Ridgway continued to solicit the services of prostitutes during this marriage."},{"text":"He also wanted his wife to participate in sex in public and inappropriate places, sometimes even in areas where his victims' bodies were later discovered."},{"text":"According to women in his life, Ridgway had an insatiable sexual appetite."},{"text":"His three ex-wives and several ex-girlfriends reported that Ridgway demanded sex from them several times a day."},{"text":"Often, he would want to have sex in a public area or in the woods."},{"text":"Ridgway himself admitted to having a fixation with prostitutes, with whom he had a love-hate relationship."},{"text":"He frequently complained about their presence in his neighborhood, but he also took advantage of their services regularly."},{"text":"It has been speculated that Ridgway was torn between his uncontrollable lusts and his staunch religious beliefs."}]],["Murders",[{"text":"Throughout the 1980s and 1990s, Ridgway is believed to have murdered at least 71 women (according to Ridgway, in an interview with Sheriff Reichert in 2001) near Seattle and Tacoma, Washington.","links":[{"page":"Dave Reichert","src":"Sheriff Reichert"},{"page":"Seattle"},{"page":"Tacoma, Washington"}]},{"text":"His court statements later reported that he had killed so many, he lost count."},{"text":"A majority of the murders occurred between 1982 and 1984."},{"text":"The victims were believed to be either prostitutes or runaways picked up along Pacific Highway South (International Blvd. 99), whom he strangled.","links":[{"page":"Prostitutes"},{"page":"Washington State Route 99","src":"International Blvd. 99"},{"page":"Strangled"}]},{"text":"Most of their bodies were dumped in wooded areas around the Green River, except for two confirmed and another two suspected victims found in the Portland, Oregon area.","links":[{"page":"Green River (Duwamish River)","src":"Green River"},{"page":"Portland, Oregon"}]},{"text":"The bodies were often left in clusters, sometimes posed, usually nude."},{"text":"He would sometimes return to the victims' bodies and have sexual intercourse with them.","links":[{"page":"Necrophilia","src":"sexual intercourse with them"}]},{"text":"Because most of the bodies were not discovered until only the skeletons remained, three victims are still unidentified.","links":[{"page":"Skeleton"}]},{"text":"Ridgway occasionally contaminated the dump sites with gum, cigarettes, and written materials belonging to others, and he even transported a few victims' remains across state lines into Oregon to confuse the police.<ref name=MalengOR> quote=Ridgway acknowledged that, in an effort to throw off the Task Force, he moved Denise’s remains and those of Shirley Sherrill to Oregon in the spring of 1984.","links":[{"page":"Contaminated"},{"page":"Oregon"}]},{"text":"One weekend, he took his son on what he described as a “camping” trip to Oregon."},{"text":"He transported the remains, with son’s clothes and bicycle, in the trunk of a Plymouth Satellite."},{"text":"Ridgway paid cash for his food and gas on this trip and was careful not to leave any record linking him to Oregon."},{"text":"|quote=Ridgway acknowledged that, in an effort to throw off the Task Force, he moved Denise’s remains and those of Shirley Sherrill to Oregon in the spring of 1984."},{"text":"One weekend, he took his son on what he described as a “camping” trip to Oregon."},{"text":"He transported the remains, with son’s clothes and bicycle, in the trunk of a Plymouth Satellite."},{"text":"Ridgway paid cash for his food and gas on this trip and was careful not to leave any record linking him to Oregon.}}"},{"text":"Ridgway began each murder by picking up a woman, usually a prostitute."},{"text":"He sometimes showed the woman a picture of his son, to trick her into trusting him."},{"text":"After raping her, Ridgway strangled her from behind."},{"text":"He initially strangled them manually."},{"text":"However, many victims inflicted wounds and bruises on his arm while trying to defend themselves."},{"text":"Concerned these wounds and bruises would draw attention, Ridgway began using ligatures to strangle his victims.","links":[{"page":"Strangling strangulation","src":"ligatures"}]},{"text":"He killed most victims in his home, his truck, or a secluded area."},{"text":"In the early 1980s, the King County Sheriff's Office formed the Green River Task Force to investigate the murders."},{"text":"The most notable members of the task force were Robert Keppel and Dave Reichert, who periodically interviewed incarcerated serial killer Ted Bundy from 1984.","links":[{"page":"Robert Keppel"},{"page":"Dave Reichert"},{"page":"Ted Bundy"}]},{"text":"Bundy offered his opinions on the psychology, motivations, and behavior of the killer; he suggested that the killer was revisiting the dump sites to have sexual relations with his victims, which turned out to be true, and if police found a fresh grave, they should stake it out and wait for him to come back."},{"text":"Also contributing to the investigation was John E. Douglas, who has since written much on the subject of the Green River Killer.","links":[{"page":"John E. Douglas"}]},{"text":"Ridgway was arrested in 1982 and 2001 on charges related to prostitution."},{"text":"He became a suspect in 1983 in the Green River killings."},{"text":"In 1984, Ridgway took and passed a polygraph test (quality control protocols later developed in the FBI after careful review determined that Ridgway actually failed his polygraph test), and on April 7, 1987, police took hair and saliva samples from Ridgway.","links":[{"page":"Polygraph test"},{"page":"Saliva"}]},{"text":"Around 1985, Ridgway began dating Judith Mawson, who became his third wife in 1988."},{"text":"Mawson claimed in a 2010 television interview that when she moved into his house while they were dating, there was no carpet."},{"text":"Detectives later told her he had probably wrapped a body in the carpet."},{"text":"In the same interview, she described how he would leave for work early in the morning some days, ostensibly for the overtime pay.","links":[{"page":"Overtime"}]},{"text":"Mawson speculated that he must have committed some of the murders while supposedly working these early morning shifts."},{"text":"She claimed that she had not suspected Ridgway's crimes before she was contacted by authorities in 1987, and had not even heard of the Green River Killer before that time because she did not watch the news."},{"text":"Author Pennie Morehead interviewed Ridgway in prison, and he said while he was in the relationship with Mawson his kill rate went down, and he truly loved her."},{"text":"Mawson told a local television reporter, \"I feel I have saved lives ... by being his wife and making him happy.\""},{"text":"The samples collected in 1987 were later subjected to a DNA analysis, providing the evidence for his arrest warrant.","links":[{"page":"DNA analysis"},{"page":"Warrant (law)","src":"warrant"}]},{"text":"On November 30, 2001, Ridgway was at the Kenworth Truck factory, where he worked as a spray painter, when police arrived to arrest him."},{"text":"Ridgway was arrested on suspicion of murdering four women nearly 20 years after first being identified as a potential suspect, when DNA evidence conclusively linked semen left in the victims to the saliva swab taken by the police.","links":[{"page":"DNA"},{"page":"Semen"}]},{"text":"The four victims named in the original indictment were Marcia Chapman, Opal Mills, Cynthia Hinds, and Carol Ann Christensen.","links":[{"page":"Indictment"}]},{"text":"Three more victims—Wendy Coffield, Debra Bonner, and Debra Estes—were added to the indictment after a forensic scientist identified microscopic spray paint spheres as a specific brand and composition of paint used at the Kenworth factory during the specific time frame when these victims were killed.","links":[{"page":"Microscopic"}]}]],["Plea bargain, confessions, sentencing",[{"text":"Early in August 2003, Seattle television news reported that Ridgway had been moved from a maximum security cell at King County Jail to an Airway Heights Minimum-Medium Security Level Tank.","links":[{"page":"Seattle"},{"page":"Incarceration in the United States levels","src":"maximum security"}]},{"text":"Other news reports stated that his lawyers, led by Anthony Savage, were closing a plea bargain that would spare him the death penalty in return for his confession to a number of the Green River murders.","links":[{"page":"Plea bargain"},{"page":"Death penalty"}]},{"text":"On November 5, 2003, Ridgway entered a guilty plea to 48 charges of aggravated first degree murder as part of a plea bargain, agreed to in June, that would spare him execution in exchange for his cooperation in locating the remains of his victims and providing other details.","links":[{"page":"Guilty plea"},{"page":"First degree murder","src":"aggravated first degree murder"}]},{"text":"In his statement accompanying his guilty plea, Ridgway explained that all of his victims had been killed inside King County, Washington, and that he had transported and dumped the remains of the two women near Portland to confuse the police."},{"text":"Deputy prosecutor Jeffrey Baird noted in court that the deal contained \"the names of 41 victims who would not be the subject of State v. Ridgway if it were not for the plea agreement.\" King County Prosecuting Attorney Norm Maleng explained his decision to make the deal:","links":[{"page":"Plea agreement"},{"page":"King County Prosecuting Attorney"},{"page":"Norm Maleng"}]},{"text":"On December 18, 2003, King County Superior Court Judge Richard Jones sentenced Ridgway to 48 life sentences with no possibility of parole and one life sentence, to be served consecutively.","links":[{"page":"King County Superior Court"},{"page":"Life imprisonment","src":"life sentences"},{"page":"Parole"}]},{"text":"He was also sentenced to an additional 10 years for tampering with evidence for each of the 48 victims, adding 480 years to his 48 life sentences.","links":[{"page":"Tampering with evidence"}]},{"text":"Ridgway led prosecutors to three bodies in 2003."},{"text":"On August 16 of that year, the remains of a 16-year-old girl found near Enumclaw, Washington, 40 feet from State Route 410, were pronounced as belonging to Pammy Annette Avent, who had been believed to be a victim of the Green River Killer.","links":[{"page":"Enumclaw, Washington"},{"page":"Washington State Route 410","src":"State Route 410"}]},{"text":"The remains of Marie Malvar and April Buttram were found in September."},{"text":"On November 23, 2005, The Associated Press reported that a weekend hiker found the skull of one of the 48 women Ridgway admitted murdering in his 2003 plea bargain with King County prosecutors.","links":[{"page":"Associated Press","src":"The Associated Press"},{"page":"Human skull","src":"skull"}]},{"text":"The skull of Tracy Winston, who was 19 when she disappeared from Northgate Mall on September 12, 1983, was found on 2014-11-11 mdy}} quote=Ridgway acknowledged that, in an effort to throw off the Task Force, he moved Denise’s remains and those of Shirley Sherrill to Oregon in the spring of 1984.","links":[{"page":"Northgate Mall (Seattle)","src":"Northgate Mall"}]},{"text":"One weekend, he took his son on what he described as a “camping” trip to Oregon."},{"text":"He transported the remains, with son’s clothes and bicycle, in the trunk of a Plymouth Satellite."},{"text":"Ridgway paid cash for his food and gas on this trip and was careful not to leave any record linking him to Oregon."},{"text":"by a man hiking in a wooded area near Highway 18 near Issaquah, southeast of Seattle.","links":[{"page":"Issaquah, Washington","src":"Issaquah"}]},{"text":"quote=Ridgway acknowledged that, in an effort to throw off the Task Force, he moved Denise’s remains and those of Shirley Sherrill to Oregon in the spring of 1984."},{"text":"One weekend, he took his son on what he described as a “camping” trip to Oregon."},{"text":"He transported the remains, with son’s clothes and bicycle, in the trunk of a Plymouth Satellite."},{"text":"Ridgway paid cash for his food and gas on this trip and was careful not to leave any record linking him to Oregon."},{"text":"|title=Remains of a Green River killer victim found near Issaquah |url=http://seattletimes.com/html/localnews/2002641105_greenriver23m.html |newspaper=The Seattle Times |accessdate=2014-11-11 mdy}} quote=Ridgway acknowledged that, in an effort to throw off the Task Force, he moved Denise’s remains and those of Shirley Sherrill to Oregon in the spring of 1984."},{"text":"One weekend, he took his son on what he described as a “camping” trip to Oregon."},{"text":"He transported the remains, with son’s clothes and bicycle, in the trunk of a Plymouth Satellite."},{"text":"Ridgway paid cash for his food and gas on this trip and was careful not to leave any record linking him to Oregon."},{"text":"}}"},{"text":"Ridgway confessed to more confirmed murders than any other American serial killer."},{"text":"Over a period of five months of police and prosecutor interviews, he confessed to 48 murders—42 of which were on the police's list of probable Green River Killer victims."},{"text":"On February 9, 2004, county prosecutors began to release the videotape records of Ridgway's confessions."},{"text":"In one taped interview, he told investigators initially that he was responsible for the deaths of 65 women, but in another taped interview with Reichert on December 31, 2003, Ridgway claimed to have murdered 71 victims and confessed to having had sex with them before killing them, a detail which he did not reveal until after his sentencing."},{"text":"In his confession, he acknowledged that he targeted prostitutes because they were \"easy to pick up\" and that he \"hated most of them.\" He confessed that he had sex with his victims' bodies after he murdered them, but claimed he began burying the later victims so that he could resist the urge to commit necrophilia.","links":[{"page":"Necrophilia"}]},{"text":"Ridgway talked to and tried to make his victims comfortable before he committed the murders."},{"text":"In his own words, \"I would talk to her... and get her mind off of the, sex, anything she was nervous about. And think, you know, she thinks, 'Oh, this guy cares'... which I didn't. I just want to, uh, get her in the vehicle and eventually kill her.\""},{"text":"Later in a statement Ridgway said that murdering young women was his \"career\"."}]],["Life imprisonment",[{"text":"Ridgway was placed in solitary confinement at Washington State Penitentiary in Walla Walla in January 2004.","links":[{"page":"Washington State Penitentiary"},{"page":"Walla Walla, Washington","src":"Walla Walla"}]},{"text":"Roughly around 2005, Ridgway made more pleas with the Federal government and was transferred to Airway Heights where he was put in a minimum-medium security tank."},{"text":"On May 14, 2015, he was transferred to the USP Florence, a high-security federal prison east of Cañon City, Colorado.","links":[{"page":"United States Penitentiary, Florence High","src":"USP Florence"},{"page":"Cañon City, Colorado"}]},{"text":"In September 2015, after a public outcry and discussions with Gov. Jay Inslee, Corrections Secretary Bernie Warner announced that Ridgway would be transferred back to Washington to be “easily accessible” for open murder investigations."},{"text":"Ridgway was returned by chartered plane to Washington from the High Security Federal Prison in Florence, Colorado, on October 24, 2015.","links":[{"page":"United States Penitentiary, Florence High","src":"High Security Federal Prison"}]}]],["Victims",[{"text":"Before Ridgway's confession, authorities had attributed 49 murders to the Green River Killer."},{"text":"Ridgway confessed to murdering at least 71 victims."}]],["Confirmed",[{"text":"At the time of his December 18, 2003 sentencing, authorities had been able to find at least 48 sets of remains, including victims not originally attributed to the Green River Killer."},{"text":"Ridgway was sentenced for the deaths of each of these 48 victims, with a plea agreement that he would \"plead guilty to any and all future cases (in King County) where his confession could be corroborated by reliable evidence.\""},{"text":"* Before Ridgway's confession, authorities had not attributed to the Green River Killer the deaths of victims Rule, Barczak, Hayes, Reeves, Yellowrobe and 'victim 49'."},{"text":"* Ridgway's confession and directions led police search crews to find the bodies of Avent, Buttram, and Malvar in August and September 2003."},{"text":"* On Tuesday, December 21, 2010, hikers near the West Valley Highway in Auburn, WA found a skull in the vicinity of where Marie Malvar's remains were found in 2003."},{"text":"The skull was identified as belonging to Rebecca \"Becky\" Marrero, who was last seen leaving the Western Six Motel at South 168th Street and Pacific Highway South on December 3, 1982."},{"text":"The King County Prosecutor confirmed that Ridgway would be formally charged with her murder on February 11, 2011."},{"text":"On February 18, 2011, he entered a guilty plea in the murder of Rebecca Marrero, adding a 49th life sentence to his existing 48. Ridgway confessed to murdering Marrero in his original plea bargain, but due to insufficient evidence, the charges could not be filed."},{"text":"Therefore, there is no change in his current incarceration status."},{"text":"* The remains of Tracy Winston were found, without a skull, in Kent's Cottonwood Grove Park in March 1986.","links":[{"page":"Kent, Washington","src":"Kent"},{"page":"Cottonwood Grove Park"}]},{"text":"Winston's skull was found in November 2005 near Tiger Mountain, miles away from the discovery site of the rest of her body."},{"text":"Police assume someone carried it to the location."},{"text":"* Sandra Denise Major was not identified until June 2012."},{"text":"A family member asked the King County Sheriff to investigate after seeing a TV movie about Ridgway."},{"text":"DNA confirmed Major's identity."},{"text":"* Jane Doe B-10, discovered on March 21, 1984, is currently unidentified."},{"text":"Ridgway claimed that she was a white female in her early twenties and possibly had brown hair."},{"text":"Examination of the remains suggested that she was actually between twelve and eighteen, most likely around fifteen."},{"text":"Analysis of the victim's skeleton indicated she was probably left-handed, and had at one point in her life suffered a healed skull fracture to the left temple."},{"text":"* Jane Doe B-17, also unidentified, was discovered on January 2, 1986; remains that had been found in another area February 18, 1984 were later matched to this victim."},{"text":"Ridgway claimed responsibility for her death in 2003."},{"text":"* Jane Doe B-20, a female between thirteen and twenty-four, was discovered in August 2003."},{"text":"Due to the fact that the remains were partial, her face could not be reconstructed and her race could not be determined."},{"text":"She was murdered between the twenty-year span of 1973 to 1993, but is believed to have been murdered during the first decade of Ridgway's murder spree."}]],["Task force victims list",[{"text":"Ridgway is suspected of—but not charged with—murdering the remaining six victims of the original list attributed to the Green River Killer."},{"text":"In each case, either Ridgway did not confess to the victim's death, or authorities have not been able to corroborate their suspicion with reliable evidence."},{"text":"* Seattle native Tammy Vincent, who disappeared in 1979, was later thought to be a possible victim of Ridgway.","links":[{"page":"Tammy Vincent"}]},{"text":"In 1979, her body had been found stabbed and shot to death in Tiburon, California.","links":[{"page":"Tiburon, California"}]},{"text":"Her remains were not identified until 2007."},{"text":"He did not confirm involvement in her death, which was likely caused by a different person."},{"text":"* Ridgway denied killing Amina Agisheff."},{"text":"Agisheff does not fit the profile of any of the victims of the Green River Killer considering her age, and she was not a prostitute or a teenage runaway.","links":[{"page":"Victimology","src":"profile"}]},{"text":"* Although he has never been charged with her murder, during police interrogations in 2003, Ridgway did confess to killing Kase Ann Lee (Woods)."},{"text":"He stated that he strangled Lee in 1982 and left her body near a drive-in theatre off the Sea-Tac Strip.","links":[{"page":"Washington State Route 99","src":"Sea-Tac Strip"}]},{"text":"Law enforcement officials have been unable to locate Lee's remains at the dump site that Ridgway indicated."},{"text":"* Evidence exists to suggest that Ridgway murdered Kelly Kay McGinniss."},{"text":"Shortly before her disappearance, McGinniss was questioned by a Port of Seattle police officer while \"dating\" Ridgway near the SeaTac Strip.","links":[{"page":"SeaTac, Washington","src":"SeaTac"}]},{"text":"Furthermore, during the summer of 2003, Ridgway led authorities to the bodies of several of his victims."},{"text":"One of those bodies (later identified as that of April Buttram) was initially identified by Ridgway as being that of McGinness."},{"text":"According to Ridgway, he often confused McGinness with Buttram because of their similar physiques."},{"text":"* Ridgway is a suspect in the deaths of Angela Marie Girdner and Tammie Liles."},{"text":"Their bodies were discovered within a mile of the bodies of known victims Shirley Shirell and Denise Bush."},{"text":"Liles remained unidentified until 1998 and Girdner until October 2009."}]],["Suspected",[{"text":"Ridgway has been considered a suspect in the disappearances/murders of five other women not attributed at the time to the Green River Killer."},{"text":"No charges have been filed."},{"text":"*Martha Morrison disappeared from her apartment in Oregon in 1974."},{"text":"Her body was found along with another victim in Washington later that year."},{"text":"Morrison's case was speculated to have been related to the Green River killings."},{"text":"Her remains were identified in 2015."},{"text":"* An unidentified black female, possibly bearing the first name Michelle, was a possible victim of Ridgway."},{"text":"She has never been located or identified."},{"text":"* Cora McGuirk was the mother of National Basketball Association player Martell Webster.","links":[{"page":"National Basketball Association"},{"page":"Martell Webster"}]},{"text":"McGuirk disappeared when her son was four years old."},{"text":"* Ridgway was recently ruled out in the murder of Rose Marie Kurran (sometimes spelled \"Curran\")."}]],["In artwork",[{"text":"* In 2004, Phil Hansen created and displayed artwork depicting Gary Ridgway's face, composed of 11,792 portraits of the 48 victims.","links":[{"page":"Phil Hansen (artist)","src":"Phil Hansen"}]}]],["In documentaries and films (non-fiction)",[{"text":"* The 1984 documentary Murder, No Apparent Motive, about serial killers and FBI Profilers, mentioned that the (then) ongoing Green River Killer's murders were one of the latest examples of serial murders that go on in America without any apparent motives.","links":[{"page":"Serial killers"},{"page":"FBI method of profiling","src":"FBI Profilers"}]},{"text":"* The Riverman is based on the true story of Ted Bundy assisting investigators trying to identify and catch the Green River Killer.","links":[{"page":"Ted Bundy"}]},{"text":"It is based on the book of the same name by Robert D. Keppel.","links":[{"page":"Robert D. Keppel"}]},{"text":"* The direct-to-DVD movie Green River Killer was released in 2005.","links":[{"page":"Direct-to-DVD"},{"page":"Green River Killer (film)","src":"Green River Killer"}]},{"text":"* A 2006 episode of the TV series Crimes That Shook the World focuses on Gary Ridgway (played by Frank Violi).","links":[{"page":"Crimes That Shook the World"}]},{"text":"* In 2008, the Lifetime Movie Network aired The Capture of the Green River Killer, a TV movie loosely based on his crimes.","links":[{"page":"Lifetime Movie Network"},{"page":"The Capture of the Green River Killer"},{"page":"TV movie"}]},{"text":"John Pielmeier portrays Ridgway.","links":[{"page":"John Pielmeier"}]},{"text":"In 2014, they aired a documentary called My Uncle is the Green River Killer which featured Ridgway family members."},{"text":"*The ninth episode of the 2010 American documentary show Who the (Bleep) Did I Marry? features his story and his third wife's side of it.","links":[{"page":"Who the (Bleep) Did I Marry?"}]}]],["In print (non-fiction)",[{"text":"*Search for the Green River Killer by Carlton Smith with help from Tom Guillen (March 5, 1991)"},{"text":"*The Riverman: Ted Bundy and I Hunt for the Green River Killer by Robert D. Keppel (November 27, 1995)","links":[{"page":"Robert D. Keppel"}]},{"text":"*The Green River Killer by the King County Journal Staff (November 23, 2003)"},{"text":"*Chasing the Devil by Sheriff David Reichert (July 28, 2004)","links":[{"page":"David Reichert"}]},{"text":"*Green River, Running Red by true-crime author and former police officer Ann Rule (September 27, 2005)","links":[{"page":"Ann Rule"}]},{"text":"*Serial Killers: Issues Explored Through Green River Murders by Tomas Guillen (January 14, 2006)"},{"text":"*Green River Serial Killer: Biography of an Unsuspecting Wife by Pennie Morehead, telling the story of his third wife and her struggles with the truth (April 1, 2007)"},{"text":"*Case of the Green River Killer by Diane Yancey (April 27, 2007)"},{"text":"*Defending Gary: Unraveling the Mind of the Green River Killer by Mark Prothero with help from Carlton Smith (May 25, 2007)","links":[{"page":"Mark Prothero"}]},{"text":"*Green River Killer: The True Detective Story, a 2011 graphic novel by Jeff Jensen and Jonathan Case.","links":[{"page":"Jeff Jensen"},{"page":"Jonathan Case"}]},{"text":"Jensen's father was Tom Jensen, one of the detectives who worked on the case for 20 years."},{"text":"*The Thirty-Ninth Victim by Arleen Williams, sister of Maureen Sue Feeney (April 6, 2008)"}]],["In print (fiction)",[{"text":"* The Green River murders are discussed in the Jodi Picoult novel House Rules.","links":[{"page":"Jodi Picoult"},{"page":"House Rules (novel)","src":"House Rules"}]},{"text":"* The novel River by Roderick Thorp is subtitled \"A Novel of the Green River Killings\".","links":[{"page":"River (novel)","src":"River"},{"page":"Roderick Thorp"}]},{"text":"ISBN 044990704X"}]],["In music",[{"text":"* The 2002 song \"Deep Red Bells\" by Neko Case was inspired by her own life growing up as a teenager near the metropolis during the time of the murders.","links":[{"page":"Neko Case"}]},{"text":"* In 2003, Philadelphia power electronics duo Deathpile released G.R., a concept album about Ridgway and his murders.","links":[{"page":"Philadelphia"},{"page":"Power electronics (music)","src":"power electronics"}]},{"text":"* The 1998 song \"I Wanna Know What Love Is\" off the Kathleen Hanna electronic album Julie Ruin mentions the Green River Killer and his violence against women.","links":[{"page":"Kathleen Hanna"},{"page":"Julie Ruin"}]}]],["In television (fiction)",[{"text":"* In an episode of Everybody Hates Chris, after confronting Julius about a credit card he had been hiding from Rochelle for 15 years, she asks him if he is the \"Green River Killer.\"","links":[{"page":"Everybody Hates Chris"}]},{"text":"* In a May 2013 interview, Veena Sud stated her inspiration for The Killing season 3 (2013) came from Streetwise, Mary Ellen Mark's book of photographs about teenaged runaways in Seattle that was made into an eponymous 1984 documentary.","links":[{"page":"Veena Sud"},{"page":"The Killing (season 3) and development","src":"The Killing season 3 (2013)"},{"page":"Mary Ellen Mark"},{"page":"Streetwise (1984 film)","src":"1984 documentary"}]},{"text":"One of the street kids Mark documented in that and later books (21-year-old Roberta Joseph Hayes), fell victim to The Green River Killer (Gary Ridgway)."},{"text":"(Sud had stated she was \"very fascinated\" with Ridgway, the serial killer of numerous women and girls near Seattle and Tacoma, Washington in the 1980s and 1990s.)"},{"text":"* Oliver Knox, a serial killer on the science fiction show The 4400, bears a number of similarities to Gary Ridgway.","links":[{"page":"The 4400"}]}]]]